Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalDiscrepancyWarning Property
 Distance between Analytical and Physical Models of Structural Element is beyond tolerance of [Value]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalDiscrepancyWarning { get; }
Public Shared ReadOnly Property AnalyticalDiscrepancyWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalDiscrepancyWarning {
	FailureDefinitionId^ get ();
}
static member AnalyticalDiscrepancyWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace